<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Licencia</title>
<style type="text/css">
>
<!--
body {
  font-family: arial, helvetica, sans serif;
  font-size: 11px;
  background: #E9ECEF;
}

p {
  font-family: arial, helvetica, sans serif;
  font-size: 11px;
}

h2 {
  font-family: arial, helvetica, sans serif;
  font-size: 13px;
  font-weight: bold;
}

h3 {
  font-family: arial, helvetica, sans serif;
  font-size: 12px;
  font-weight: bold;
}

h4 {
  font-family: arial, helvetica, sans serif;
  font-size: 11px;
  font-weight: bold;
}

li {
  font-family: arial, helvetica, sans serif;
  font-size: 11px;
}

pre {
  font-size: 11px;
}
-->
</style>
</head>
<body>
<h2>Contenido</h2>
<ul>
  <li><a href="gpl.html#SEC1" name="TOC1" id="TOC1">GNU  LICENCIA PUBLICO GENERAL</a>
	<ul>
	  <li><a href="gpl.html#SEC2" name="TOC2" id="TOC2">Preambulo</a>	  </li>
			<li><a href="gpl.html#SEC3" name="TOC3" id="TOC3">TERMINOS Y CONDICIONES PARA LA COPIA, distribuci&oacute;n y modificaci&oacute;n</a>	  </li>
			<li><a href="gpl.html#SEC4" name="TOC4" id="TOC4">C&oacute;mo aplicar estos t&eacute;rminos a sus nuevos programas</a>	</li>
		</ul>
	</li>
</ul>
<p></p>
<hr />
<h2><a href="gpl.html#TOC1" name="SEC1" id="SEC1">GNU LICENCIA PUBLICO GENERAL </a></h2>
<p> Version 1, Junio 1991 </p>
<pre>
Copyright (C) 1989, 1991 Free Software Foundation, Inc.
59 Temple Place - Suite 330, Boston, MA  02111-1307, USA

Se permite la copia y distribuci&oacute;n de copias literales
 de este documento de licencia, pero no está permitido.
</pre>
<h2><a href="gpl.html#TOC2" name="SEC2" id="SEC2">Preambulo</a></h2>
<p> Las licencias de la mayor&iacute;a del software est&aacute;n dise&ntilde;adas para quitarle a usted la libertad de compartirlo y modificarlo. Por el contrario, la Licencia P&uacute;blica General de GNU pretende garantizarle la libertad de compartir y modificar software libre - para asegurarse de que el software es libre para todos sus usuarios. Esta Licencia P&uacute;blica General se aplica a la mayor&iacute;a del software de la Free Software Foundation ya cualquier otro programa si sus autores se comprometen a utilizarla. (Existe otro software de la Free Software Foundation est&aacute; cubierto por la licencia GNU Biblioteca P&uacute;blica General). Usted tambi&eacute;n puede aplicarla a sus propios programas. 

Cuando hablamos de software libre, nos estamos refiriendo a la libertad, no de precio. Nuestras Licencias P&uacute;blicas Generales est&aacute;n dise&ntilde;adas para asegurarse de que usted tiene la libertad de distribuir copias de software libre (y cobrar por ese servicio si quiere), que reciba el c&oacute;digo fuente o que pueda conseguirlo si lo quiere, de que puede cambiar el piezas de software o el uso de &eacute;l en nuevos programas libres, y que usted sabe que puede hacer estas cosas. 

Para proteger sus derechos necesitamos algunas restricciones que prohiban a cualquiera negarle a usted estos derechos o pedirle que renuncie a ellos. Estas restricciones se traducen en ciertas obligaciones que le afectan si distribuye copias del software, o si lo modifica. 

Por ejemplo, si distribuye copias de tal programa, ya sea gratuitamente, oa cambio de una contraprestaci&oacute;n, debe dar a los receptores todos los derechos que usted tiene. Usted debe asegurarse de que ellos tambi&eacute;n reciban o puedan conseguir el c&oacute;digo fuente. Y debe mostrarles estas condiciones de forma que conozcan sus derechos. 

Nosotros protegemos sus derechos con dos pasos: (1) derechos de autor del software, y (2) le ofrecemos esta licencia que le da permiso legal para copiar, distribuir y / o modificar el software. 

Adem&aacute;s, para la protecci&oacute;n de cada autor y la nuestra propia, queremos asegurarnos de que todos entiendan que no es ninguna garant&iacute;a para este software libre. Si el software es modificado por alguien y lo distribuye, queremos que sus receptores sepan que lo que tienen no es el original, por lo que cualquier problema introducido por otros no afecte a la reputaci&oacute;n del autor original. 

Finalmente, cualquier programa libre est&aacute; constantemente amenazado por las patentes de software. Queremos evitar el peligro de que los redistribuidores de un programa libre obtengan patentes por su cuenta, convirtiendo el programa en propietario. Para evitar esto, hemos dejado claro que cualquier patente debe ser pedida para el uso libre de cualquiera o no ser pedida. 

Los t&eacute;rminos y condiciones para la copia, distribuci&oacute;n y modificaci&oacute;n siguen.</p>

<h2><a href="gpl.html#TOC3" name="SEC3" id="SEC3">TERMINOS Y CONDICIONES PARA LA COPIA, distribuci&oacute;n y modificaci&oacute;n</a></h2>
<p> <strong>0.</strong> Esta Licencia se aplica a cualquier programa u otro trabajo que contenga una nota colocada por el tenedor del copyright diciendo que puede ser distribuido bajo los t&eacute;rminos de esta Licencia P&uacute;blica General. El "Programa", a continuaci&oacute;n, se refiere a cualquier programa u obra, y un "trabajo basado en el Programa" significa el Programa o cualquier trabajo derivado bajo la ley de derechos de autor: es decir, un trabajo que contenga el Programa o una porci&oacute;n de que, ya sea literal o con modificaciones y / o traducido a otro idioma. (En adelante, la traducci&oacute;n est&aacute; incluida sin limitaciones en el t&eacute;rmino "modificaci&oacute;n".) Cada concesionario se dirige como "usted".</p>
<p> Actividades distintas de la copia, distribuci&oacute;n y modificaci&oacute;n no est&aacute;n cubiertas por esta Licencia, est&aacute; fuera de su alcance. El acto de ejecutar el Programa no est&aacute; restringido, y los resultados del Programa est&aacute;n cubiertos &uacute;nicamente si sus contenidos constituyen un trabajo basado en el Programa (independiente de haber sido producido mediante la ejecuci&oacute;n del Programa). Si eso es verdad depende de lo que haga el programa.</p>
<p> <strong>1.</strong> Usted puede copiar y distribuir copias exactas del c&oacute;digo fuente del Programa, seg&uacute;n lo has recibido, en cualquier medio, siempre que adecuada y bien visible publique en cada copia un anuncio de copyright adecuado y un repudio de garant&iacute;a, mantenga intactos todos los anuncios que se refieran a esta licencia y la ausencia de cualquier garant&iacute;a y proporcione a los receptores del Programa una copia de esta licencia junto con el Programa.</p>
<p> Puede cobrar un precio por el acto f&iacute;sico de transferir una copia, y puede, seg&uacute;n su albedr&iacute;o, ofrecer garant&iacute;a a cambio de una cuota.</p>
<p> <strong>2.</strong> Puede modificar su copia o copias del Programa o cualquier porci&oacute;n de &eacute;l, formando as&iacute; un trabajo basado en el Programa, y copiar y distribuir esa modificaci&oacute;n o trabajo bajo los t&eacute;rminos del apartado 1 anterior, siempre que adem&aacute;s cumpla las siguientes condiciones :</p>
<p></p>
<ul>
  <li><strong>a)</strong> Debe hacer que los ficheros modificados lleven anuncios prominentes indicando que usted cambi&oacute; los archivos y la fecha de cualquier cambio.
	<p>
  </p>
	</li>
	<li><strong>b)</strong> Debe hacer que cualquier trabajo que distribuya o publique y que en su totalidad o en parte contenga o sea derivado del Programa o de cualquier parte del mismo, sea licenciado como un todo, sin cargo alguno para terceras partes bajo los t&eacute;rminos de esta licencia.
	<p>
  </p>
	</li>
	<li><strong>c)</strong> Si el programa modificado lee normalmente &oacute;rdenes interactivamente cuando es ejecutado, debe hacer que, cuando comience su ejecuci&oacute;n para ese uso interactivo de la forma m&aacute;s habitual, muestre o escriba un mensaje que incluya un aviso de copyright y un anuncio de que no hay ninguna garant&iacute;a (o por el contrario que s&iacute; se ofrece garantía) y que los usuarios pueden redistribuir el programa bajo estas condiciones, e indicando al usuario cómo ver una copia de esta licencia. (Excepci&oacute;n: si el propio programa es interactivo pero normalmente no muestra ese anuncio, su trabajo basado en el programa no es necesario para imprimir un anuncio).
</li>
</ul>
Estos requisitos se aplican al trabajo modificado como un todo. Si partes identificables de ese trabajo no son derivadas del Programa, y pueden ser razonablemente consideradas trabajos independientes y separados por ellos mismos, entonces esta Licencia y sus t&eacute;rminos no se aplican a esas partes cuando sean distribuidas como trabajos separados. Pero cuando usted distribuye las mismas secciones como parte de un todo que es un trabajo basado en el Programa, la distribuci&oacute;n del todo debe ser seg&uacute;n los t&eacute;rminos de esta licencia, cuyos permisos para otros licenciatarios se extienden al todo completo, y por lo tanto a cada y todas las partes, independientemente de qui&eacute;n lo escribi&oacute;.
<p> Por lo tanto, no es la intenci&oacute;n de este apartado reclamar derechos o desafiar sus derechos sobre trabajos escritos totalmente por usted, sino que la intenci&oacute;n es ejercer el derecho a controlar la distribuci&oacute;n de trabajos derivados o colectivos basados en el Programa.
</p>
<p>Adem&aacute;s, el simple hecho de reunir un trabajo basado en el Programa con el Programa (o con un trabajo basado en el Programa) en un volumen de un medio de almacenamiento o distribución no hace que dicho trabajo entre dentro del &aacute;mbito de esta Licencia.
</p>
<p> <strong>3.</strong> Usted puede copiar y distribuir el Programa (o un trabajo basado en &eacute;l, bajo la Secci&oacute;n 2) en c&oacute;digo objeto o ejecutable bajo los t&eacute;rminos de las Secciones 1 y 2, supuesto que adem&aacute;s cumpla una de las siguientes:
  
</p>
<ul>
  <li><strong>a)</strong> Acompa&ntilde;arlo con el c&oacute;digo completo de fuente correspondiente legible por m&aacute;quina, que debe ser distribuido bajo los t&eacute;rminos de las Secciones 1 y 2 anteriores en un medio habitualmente utilizado para el intercambio de programas, o
	<p>
  </p>
	</li>
	<li><strong>b)</strong> Acompa&ntilde;arlo con una oferta por escrito, v&aacute;lida durante al menos tres a&ntilde;os, para dar a cualquier tercero, por un coste no mayor que el costo de realizar f&iacute;sicamente la distribuci&oacute;n del fuente, que copia legible por m&aacute;quina del c&oacute;digo fuente correspondiente, que ser&aacute; distribuido bajo los t&eacute;rminos de las Secciones 1 y 2 anteriores en un medio habitualmente utilizado para el intercambio de programas, o
	<p>
  </p>
	</li>
	<li><strong>c)</strong> Acompa&ntilde;arlo con la informaci&oacute;n que recibi&oacute;, ofreciendo distribuir el c&oacute;digo fuente correspondiente. (Esta opci&oacute;n se permite s&oacute;lo para distribuci&oacute;n no comercial y sólo si usted recibi&oacute; el programa como c&oacute;digo objeto o en formato ejecutable con tal oferta, de acuerdo con el apartado b anterior.)
</li>
</ul>
El c&oacute;digo fuente para un trabajo significa la forma preferida del trabajo para hacer modificaciones a la misma. Para un trabajo ejecutable, el c&oacute;digo fuente completo todo el c&oacute;digo fuente de todos los m&oacute;dulos que contiene, adem&aacute;s de los archivos de interfaz asociado de definici&oacute;n, m&aacute;s los guiones utilizados para controlar la compilaci&oacute;n e instalaci&oacute;n del ejecutable. Sin embargo, como excepci&oacute;n especial, el c&oacute;digo fuente distribuido no necesita incluir nada que sea distribuido normalmente (bien como fuente, bien en forma binaria) con los componentes principales (compilador, kernel y similares) del sistema operativo en el cual funciona el ejecutable, a menos que el propio componente acompa&ntilde;e al ejecutable.
<p>Si la distribuci&oacute;n del ejecutable o del c&oacute;digo objeto se hace mediante la oferta acceso para copiarlo desde un lugar designado, entonces ofrecer un acceso equivalente para copiar el c&oacute;digo fuente del mismo lugar como distribuci&oacute;n del c&oacute;digo fuente, aunque terceras partes no est&eacute;n forzadas a copiar el código fuente junto con el c&oacute;digo objeto.
</p>
<p> <strong>4.</strong> Usted no puede copiar, modificar, sublicenciar o distribuir el Programa excepto como prev&eacute; expresamente esta Licencia. Cualquier intento de copiar, modificar, sublicenciar o distribuir el programa es nulo, y terminar&aacute; autom&aacute;ticamente sus derechos bajo esta Licencia. Sin embargo, las partes que hayan recibido copias o derechos de usted bajo esta Licencia no ver&aacute;n terminadas sus licencias, siempre y cuando esas partes continúen cumpli&eacute;ndola.
</p>
<p> <strong>5.</strong> Usted no est&aacute; obligado a aceptar esta licencia, ya que no la ha firmado. Sin embargo, nada m&aacute;s le concede permiso para modificar o distribuir el Programa o sus trabajos derivados. Estas acciones est&aacute;n prohibidas por la ley si no acepta esta Licencia. Por lo tanto, si modifica o distribuye el Programa (o cualquier trabajo basado en el Programa), est&aacute; indicando que acepta esta Licencia para poder hacerlo, y todos sus t&eacute;rminos y condiciones para copiar, distribuir o modificar el Programa o trabajos basados en &eacute;l.
</p>
<p> <strong>6.</strong> Cada vez que redistribuya el Programa (o cualquier trabajo basado en el Programa), el receptor recibe autom&aacute;ticamente una licencia del licenciatario original para copiar, distribuir o modificar el Programa sujeto a estos t&eacute;rminos y condiciones. Usted no puede imponer ninguna restricci&oacute;n adicional sobre el ejercicio de los destinatarios de los derechos aquí garantizados. Usted no es responsable de asegurar el cumplimiento por parte de terceros de esta Licencia.
</p>
<p> <strong>7.</strong> Si, como consecuencia de una sentencia judicial o una acusaci&oacute;n de infracci&oacute;n de patente o por cualquier otra raz&oacute;n (no limitada a asuntos relacionados con patentes), se le imponen condiciones (ya sea por orden judicial, acuerdo u otros) que contradicen las condiciones de esta Licencia, no le exime de cumplir las condiciones de esta Licencia. Si no puede realizar distribuciones de forma que se satisfagan simult&aacute;neamente sus obligaciones bajo esta licencia y cualquier otra obligación pertinente, entonces, como consecuencia, no puede distribuir el Programa de ninguna forma. Por ejemplo, si una licencia de patente no permitiera la redistribuci&oacute;n gratuita del Programa por parte de todos aquellos que reciban copias directa o indirectamente a trav&eacute;s de usted, entonces la &uacute;nica forma de satisfacer tanto esa condici&oacute;n como esta Licencia ser&iacute;a evitar completamente la distribuci&oacute;n de la del programa.
</p>
<p> Si cualquier porci&oacute;n de este apartado se considera inv&aacute;lida o inexigible bajo cualquier circunstancia particular, el equilibrio de la secci&oacute;n est&aacute; destinada a aplicarse y la secci&oacute;n como un todo est&aacute; destinado a aplicarse en otras circunstancias.
</p>
<p> No es el prop&oacute;sito de este apartado inducirle a infringir ninguna patente ni ning&uacute;n otro derecho de propiedad o impugnar la validez de tales reclamos, esta secci&oacute;n tiene el &uacute;nico prop&oacute;sito de proteger la integridad del sistema de distribuci&oacute;n de software libre, que es implementado por pr&aacute;cticas p&uacute;blicas de la licencia. Mucha gente ha hecho contribuciones generosas a la amplia gama de software distribuido mediante ese sistema con la confianza en la aplicaci&oacute;n consistente de ese sistema, sino que es responsabilidad del autor / donante quien decida si &eacute;l o ella est&aacute; dispuesto a distribuir software mediante cualquier otro sistema y una licenciatario no puede imponer esa elecci&oacute;n.
</p>
<p> En esta secci&oacute;n se pretende dejar completamente claro lo que se cree que es una consecuencia del resto de esta Licencia.
</p>
<p> <strong>8.</strong>Si la distribuci&oacute;n y / o uso del Programa est&aacute; restringida en ciertos pa&iacute;ses, bien por patentes o por interfaces bajo copyright, el tenedor del copyright que coloca este Programa bajo esta Licencia puede a&ntilde;adir una limitaci&oacute;n expl&iacute;cita de distribuci&oacute;n geogr&aacute;fica excluyendo esos pa&iacute;ses, de modo que la distribuci&oacute;n se permita no s&oacute;lo en o entre los pa&iacute;ses excluidos. En tal caso, esta Licencia incorpora la limitaci&oacute;n como si estuviese escrita en el cuerpo de esta Licencia.
</p>
<p> <strong>9.</strong> La Free Software Foundation puede publicar versiones revisadas y / o nuevas versiones de la Licencia P&uacute;blica General de vez en cuando. Estas nuevas versiones ser&aacute;n similares en esp&iacute;ritu a la presente versi&oacute;n, pero pueden diferir en detalles para considerar nuevos problemas o preocupaciones.
</p>
<p>Cada versi&oacute;n recibe un n&uacute;mero de versi&oacute;n que la distingue. Si el Programa especifica un n&uacute;mero de versi&oacute;n de esta Licencia que se refiere a ella ya "cualquier versi&oacute;n posterior», tienes la opci&oacute;n de seguir los t&eacute;rminos y condiciones de esa versi&oacute;n o de cualquier otra versi&oacute;n posterior publicada por la Free Software Foundation. Si el Programa no especifica un n&uacute;mero de versi&oacute;n de esta Licencia, puedes escoger cualquier versi&oacute;n publicada por la Free Software Foundation.
</p>
<p> <strong>10.</strong> Si usted desea incorporar partes del Programa en otros programas libres cuyas condiciones de distribuci&oacute;n son diferentes, escribe al autor para pedirle permiso. Si el software es propiedad de la Free Software Foundation, escriba a la Free Software Foundation: algunas veces hacemos excepciones en estos casos. Nuestra decisi&oacute;n estar&aacute; guiada por el doble objetivo de preservar la libertad de todos los derivados de nuestro software libre y de promover el intercambio y la reutilizaci&oacute;n de software en general.
</p>
<p><strong>NINGUNA GARANTIA</strong></p>
<p> <strong>11.</strong> Como el programa se licencia libre de cargas, NO HAY GARANTIA PARA EL PROGRAMA, EN LA EXTENSION PERMITIDA POR LA LEY APLICABLE. EXCEPTO CUANDO SE INDIQUE POR ESCRITO, LOS DERECHOS DE AUTOR Y / U OTRAS PARTES DEL PROGRAMA "TAL CUAL" SIN GARANTIA DE NINGUN TIPO, YA SEA EXPRESA O IMPLICITA, INCLUYENDO, PERO NO LIMITADO A, LAS GARANTIAS DE COMERCIALIZACION Y APTITUD PARA UN PROPOSITO PARTICULAR . EL RIESGO EN CUANTO A LA CALIDAD Y LA EJECUCION DEL PROGRAMA ES CON USTED. SI EL PROGRAMA TIENE UN ERROR, USTED ASUME EL COSTE DE TODOS LOS SERVICIOS, reparaci&oacute;n o correcci&oacute;n.
</p>
<p> <strong>12.</strong>EN NINGUN CASO, SALVO QUE EXIJA LA LEY APLICABLE O ACORDADO POR ESCRITO DEL COPYRIGHT NI NINGUNA OTRA PARTE QUE PUEDA MODIFICAR Y / O REDISTRIBUIR EL PROGRAMA COMO SE PERMITE ARRIBA, SERA RESPONSABLE ANTE USTED POR DA&Ntilde;OS, INCLUYENDO CUALQUIER DA&Ntilde;O GENERAL, ESPECIAL, INCIDENTAL O DA&Ntilde;OS DERIVADOS DEL USO O IMPOSIBILIDAD DE USO DEL PROGRAMA (INCLUYENDO PERO NO LIMITADO A LA PERDIDA DE DATOS O DE DATOS INCORRECTOS O PERDIDAS POR USTED O POR TERCERAS PARTES O UN FALLO DEL PROGRAMA PARA OPERAR CON OTROS PROGRAMAS), INCLUSO si dicho tenedor u otra parte ha SIDO ADVERTIDO DE LA POSIBILIDAD DE TALES DA&Ntilde;OS.
</p>
<p>
</p>
<h2>FIN DE TERMINOS Y CONDICIONES</h2>
<h2><a href="gpl.html#TOC4" name="SEC4" id="SEC4">C&oacute;mo aplicar estos t&eacute;rminos a sus nuevos programas</a></h2>
<p> Si usted desarrolla un nuevo Programa, y quiere que sea del mayor uso posible para el p&uacute;blico, la mejor manera de lograrlo es hacer que el software libre que cualquiera pueda redistribuir y cambiar bajo estos t&eacute;rminos. </p>
<p> Para hacerlo, a&ntilde;ada los siguientes anuncios al programa. Lo m&aacute;s seguro es a&ntilde;adirlos al principio de cada fichero fuente para transmitir lo m&aacute;s efectivamente posible la ausencia de garant&iacute;a, y cada archivo debe tener al menos el "copyright" de l&iacute;nea y una indicaci&oacute;n de d&oacute;nde obtener la informaci&oacute;n completa se encuentra. </p>
<pre>
<var>una l&iacute;nea para indicar el nombre del programa y una idea de lo que hace.</var>
Copyright (C) <var>a&ntilde;o</var>  <var>nombre del autor</var>

Este programa es software libre, puede redistribuirlo y / o
 modificarlo bajo los t&eacute;rminos de la Licencia P&uacute;blica General de GNU
 publicada por la Free Software Foundation, versi&oacute;n 1
 de la Licencia, o (a su elecci&oacute;n) cualquier versi&oacute;n posterior.

 Este programa se distribuye con la esperanza de que sea &uacute;til,
 pero SIN NINGUNA GARANTIA, incluso sin la garant&iacute;a impl&iacute;cita de
 O IDONEIDAD PARA UN PROPOSITO PARTICULAR. ver el
 GNU General Public License para m&aacute;s detalles.

 Usted debe haber recibido una copia de la Licencia P&uacute;blica General de GNU
 junto con este programa, si no, escriba a la Free Software
 Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA
 02111-1307, EE.UU..
</pre>
<p> A&ntilde;ada tambi&eacute;n informaci&oacute;n sobre c&oacute;mo contactar con usted por correo electr&oacute;nico y en papel. </p>
<p> Si el programa es interactivo, haga que muestre un peque&ntilde;o anuncio como el siguiente, cuando comienza a funcionar en modo interactivo: </p>
<pre>
Gnomovision version 69, Copyright (C) <var>a&ntilde;o</var> <var>nombre del autor</var>
Gnomovision viene con ABSOLUTAMENTE NINGUNA GARANTIA; para m&aacute;s detalles
 escriba 'show w'. Este software es libre, y vd
 para redistribuirlo bajo ciertas condiciones; escriba 'show c'
 para m&aacute;s detalles.
</pre>
<p>Los comandos hipot&eacute;ticos <samp>`show w'</samp> y <samp>`show c'</samp> deber&iacute;an mostrar las partes adecuadas de la Licencia P&uacute;blica General. Por supuesto, los comandos que use pueden llamarse de cualquier otra <samp>`show w'</samp> y <samp>`show c'</samp>; Podr&iacute;an incluso ser pulsaciones del rat&oacute;n o elementos del men&uacute; - lo apropiado para su programa </p>
<p> Tambi&eacute;n deber&iacute;as conseguir que su empleador (si trabaja como programador) o su escuela, en su caso, a firmar una "renuncia de copyright» para el programa, si es necesario. Aqu&iacute; est&aacute; un ejemplo, altere los nombres: </p>
<pre>
Yoyodyne, Inc., renuncia a cualquier derecho de autor
 inter&eacute;s en el programa Gnomovision
 (que hace pasadas a compiladores) escrito
 por James Hacker.

<var>firma de Pepito Grillo</var>, 1 Abril 1989
Pepito Grillo, Presidente o Vicepresidente de
</pre>
<p> Esta Licencia P&uacute;blica General no permite que incluya sus programas en programas propietarios. Si su programa es una biblioteca de subrutinas, puede considerar m&aacute;s &uacute;til el permitir el enlazado de aplicaciones propietarias con la biblioteca. Si esto es lo que quieres hacer, utilizar el <a href="/licenses/lgpl.html">GNU Lesser General Public License</a> lugar de esta Licencia.
</p>
</body>
</html>
